{
  "navBar": {
    "research": "Research",
    "contac": "Contact us",
    "blog": "Tools",
    "aboutus": "About us"
  },
  "hero1": [
    {
      "title": "The First AI Research Lab in Niger",
      "description": "Our AI Research Lab is dedicated to advancing technology and creating real-world solutions that drive societal progress. We focus on leveraging AI to address local challenges, foster economic development, and improve quality of life.",
      "btnApply": "Join Us",
      "linkProgram": "Explore Our Research"
    },
    {
      "title": "Robotics Lab",
      "description": "Our Robotics Lab explores the intersection of technology and creativity. By developing advanced robotics solutions, we aim to revolutionize industries such as agriculture, healthcare, and manufacturing. Join us as we shape the future of automation and intelligent systems.",
      "btnApply": "Join Us",
      "linkProgram": "Explore Our Research"
    },
    {
      "title": "Mentorship Program",
      "description": "Our mentorship program is committed to nurturing young talent by providing hands-on experience and guidance in AI research. We aim to equip the next generation with the skills and knowledge needed to excel in the fast-growing field of AI and make a lasting impact in Niger and beyond.",
      "btnApply": "Join Us",
      "linkProgram": "Explore Our Research"
    }
  ],
  "ReseachPageSectionCard1": {
    "title": "Current Projects",
    "description": "Our research focus on leveraging technology to address local needs in Niger.",
    "FistCardTitle": "Feriji: A French-Zarma Parallel Corpus, Glossary & Translator",
    "date": "August, 2024",
    "authors": [
      "Mamadou Keita",
      "Elysabhete Ibrahim",
      "Habibatou Alfari",
      "Christopher Homan"
    ],
    "publisher": "association for Computational Linguistics",
    "researchTopics": [
      "NLP",
      "Low-Resource",
      "Zarma"
    ],
    "FistCardDescription": "Machine translation (MT) is a rapidly expanding field that has experienced significant advancements in recent years with the development of models capable of translating multiple languages with remarkable accuracy. However, the representation of African languages in this field still needs improvement due to linguistic complexities and limited resources. This applies to the Zarma language, a dialect of Songhay (of the Nilo-Saharan language family) spoken by over 5 million people across Niger and neighboring countries (Lewis et al., 2016). This paper introduces Feriji, the first robust French-Zarma parallel corpus and glossary designed for MT. The corpus, containing 61,085 sentences in Zarma and 42,789 in French, and a glossary of 4,062 words represents a significant step in addressing the need for more resources for Zarma. We fine-tune three large language models on our dataset, obtaining a BLEU score of 30.06 on the best-performing model. We further evaluate the models on human judgments of fluency, comprehension, and readability and the importance and impact of the corpus and models. Our contributions help to bridge a significant language gap and promote an essential and overlooked indigenous African language.",
    "FistCardBtn": "Read More"
  },
  "ReseachPageSectionCard2": [
    {
      "title": "Grammatical Error Correction for Low-Resource Languages: The Case of Zarma",
      "date": "Octobre, 2024",
      "authors": [
        "MamadouK.KEITA",
        "Christopher Homan",
        "Abdoulaye Hamani Sofianou",
        "Adwoa Bremang",
        "Marcos Zampieri",
        "Habibatou Abdoulaye Alfari",
        "Elysabhete Amadou Ibrahim",
        "Dennis Owusu"
      ],
      "publisher": [
        "NILab",
        "Ashesi University",
        "Rochester Institute of Technology",
        "George Mason University"
      ],
      "researchTopics": [
        "NLP, low research language, Error correction"
      ],
      "description": "Grammatical error correction (GEC) is important for improving written materials but remains challenging for low-resource languages like Zarma—spoken by over 5 million people in West Africa. This study compares rule based methods, machine translation (MT) models, and large language models (LLMs) for GEC in Zarma. We evaluate each approach’s effectiveness on our built dataset of over 250,000 examples using synthetic and human-annotated data. Our experiments show that the MT-based approach using the M2M100 model outperforms others, achieving a detection rate of 95.82% and a suggestion accuracy of 78.90% in au tomatic evaluations, and scoring 3.0 out of 5.0 in logical/grammar error correction during manual evaluations by native speakers. The rule-based method achieved perfect de tection (100%) and high suggestion accuracy (96.27%) for spelling corrections but struggled with context-level errors. LLMs like MT5 small showed moderate performance with adetection rate of 90.62% and a suggestion accuracy of 57.15%. Our work highlights the potential of MT models to enhance GEC in low-resource languages, paving the way for more inclusive NLP tools",
      "FistCardBtn": "Read More"
    },
    {
      "title": "Evaluating Human and AI Detection of AI-Generated Poetry: A Turing-like Test",
      "date": "Octobre, 2024",
      "authors": [
        "MamadouK.KEITA",
        "Christopher Homan",
        "Abdoulaye Hamani Sofianou",
        "Samarth Kolanupaka"
      ],
      "publisher": [
        "NILab",
        "Ashesi University",
        "Rochester Institute of Technology",
        "George Mason University"
      ],
      "researchTopics": [
        "AI, Human, Text, Turing"
      ],
      "description": "As artificial intelligence (AI) models become increasingly proficient in generating human-like text, particularly in creative domains like poetry, concerns arise about distinguishing between human and machine-authored works. In this study, we conduct a Turing-like test to evaluate whether human evaluators can reliably differentiate between human-written and AI-generated poetry. Our findings reveal that human evaluators achieved high identification accuracy—over 95%—with strong confidence levels, effectively distinguishing AI-generated poetry even when advanced models like GPT-4 produced sophisticated completions. In contrast, AI detection tools such as GPTZero and GPTID demonstrated limited effectiveness, with identification accuracies below 60%. These results highlight the challenges faced by AI detection tools in creative contexts and highlight the importance of human judgment in poetry writing.",
      "FistCardBtn": "Read More"
    },
    {
      "title": "ASR dataset for Niger Languages",
      "date": "Octobre, 2024",
      "authors": [
        "MamadouK.KEITA",
        "Christopher Homan",
        "Abdoulaye Hamani Sofianou",
        "Samarth Kolanupaka"
      ],
      "publisher": [
        "NILab",
        "Ashesi University",
        "Rochester Institute of Technology",
        "George Mason University"
      ],
      "researchTopics": [
        "AI, Human, Text, Turing"
      ],
      "description": "We aim to develop an ASR dataset of up to 20 hours long for 5 Niger languages.",
      "FistCardBtn": "Read More"
    }
  ],
  "Btn": {
    "btnSeeAll": "See all the project",
    "btnBackToReseach": "Back to Research",
    "DownloadThePaper": "Download the paper",
    "authors": "Authors",
    "publisher": "Publisher",
    "researchTopics": "Research Topics",
    "btnLoadMore": "Load More",
    "readMore": "Read More",
    "check": "Check",
    "backToTeam": "Back to Team",
    "btnLoadOlderBlogs": "Load Older Blogs",
    "btnApply": "Join Us",
    "linkProgram": "Explore Our Research"
  },
  "AboutUsPageHero": {
    "title": "Innovating Locally, Empowering Globally"
  },
  "AboutUsPageSection1Card1": {
    "title": "Mission & Vision",
    "titleCard1": "Mission",
    "titleCard2": "Vision",
    "bio1": "NILab is committed to advancing AI and Robotics research in Niger to address societal challenges and drive local innovation. We are dedicated to empowering communities with cutting-edge technology while promoting a culture of scientific excellence.",
    "bio2": "Our vision is to be the leading AI research hub in West Africa. We aim to develop the next generation of Niger researchers who will contribute to the global scientific community and shape the future of technology.",
    "btn1": "Learn More about our research",
    "btn2": "Join Us"
  },
  "AboutUsPageSection3": {
    "titlePartner": "Our Partners",
    "titleTeam": "Meet the Team"
  },
  "AboutUsPageSection4Card": [
    {
      "name": "Sofiane Abdoulaye",
      "post": "Youth Leadership Coordinator",
      "bio": "Passionate advocate for education and leadership development. Co-founded the Next Leadership program.",
      "btn": "Learn More"
    },
    {
      "name": "Mahamadou Keita",
      "post": "Mentor",
      "bio": "Passionate advocate for education and leadership development. Co-founded the Next Leadership program.",
      "btn": "Learn More"
    },
    {
      "name": "Nafissa Issa",
      "post": "Co-Founder",
      "bio": "Passionate advocate for education and leadership development. Co-founded the Next Leadership program.",
      "btn": "Learn More"
    },
    {
      "name": "Mahamadou Keita",
      "post": "Mentor",
      "bio": "Passionate advocate for education and leadership development. Co-founded the Next Leadership program.",
      "btn": "Learn More"
    },
    {
      "name": "Nafissa Issa",
      "post": "Co-Founder",
      "bio": "Passionate advocate for education and leadership development. Co-founded the Next Leadership program.",
      "btn": "Learn More"
    }
  ],
  "BlogPageHero": {
    "title": "Our Tools && Innovations",
    "bio": "Innovating Locally, Empowering Globally."
  },
  "BlogPageSection1": {
    "title": "Our Tools",
    "searchBlog": "Search blogs..."
  },
  "blogPosts": {
    "niLabBlog001": {
      "title": "French Zarma translator ",
      "description": "The first French Zarma translator."
    },
    "niLabBlog002": {
      "title": "GEC ZARMA",
      "description": "Grammatical error correction tool."
    },
    "niLabBlog003": {
      "title": "AI Made contents in Zarma",
      "description": "AI generated contents in Zarma"
    }
  },
  "ContactUsPage": {
    "title": "Connect With Us"
  },
  "ContactUsPageForm": {
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "btn": "Submit"
  },
  "teamMembers": {
    "sofiane": {
      "name": "Keita",
      "position": "Head of Research",
      "bio": "...",
      "story": "With years of experience...",
      "quote": "Innovating Locally, Empowering Globally."
    },
    "maya": {
      "name": "Sofianou",
      "position": "Head of software Engineering",
      "bio": "As a dedicated Software Engineer at the nilab, I contribute to innovative projects by designing and developing software solutions that bridge technology with hands-on applications. My role involves leveraging my full-stack expertise to create scalable, efficient, and user-centered systems that enhance the fablab's offerings. Passionate about merging technical skill with creativity, I collaborate with a multidisciplinary team to bring ideas from concept to functional reality, ensuring each project meets the highest standards of quality and innovation. With a strong background in development and a commitment to continuous learning, I thrive on pushing the boundaries of what's possible in the fablab environment.",
      "story": "As a dedicated Software Engineer at the nilab, I contribute to innovative projects by designing and developing software solutions that bridge technology with hands-on applications. My role involves leveraging my full-stack expertise to create scalable, efficient, and user-centered systems that enhance the nilab's offerings. Passionate about merging technical skill with creativity, I collaborate with a multidisciplinary team to bring ideas from concept to functional reality, ensuring each project meets the highest standards of quality and innovation. With a strong background in development and a commitment to continuous learning, I thrive on pushing the boundaries of what's possible in the nilab environment.",
      "quote": "Code is my canvas, the nilab is my workshop. Here, creativity and logic meet to bring innovative ideas to life—one line of code at a time."
    },
    "ali": {
      "name": "Seydou Diallo",
      "position": "Head of Robotics",
      "bio": "As the Head of Robotics at the , I lead the charge in advancing our robotics projects, blending technical expertise with a visionary approach. My role involves guiding a talented team in the design, development, and implementation of cutting-edge robotic systems that push the boundaries of automation and AI integration. Passionate about exploring new technologies, I work to ensure that each project not only meets rigorous technical standards but also delivers real-world impact. I am committed to fostering an environment of innovation, continuous learning, and collaboration, making the nilab a hub for groundbreaking robotics research and application.",
      "story": "After studying business...",
      "quote": "Building the future, one robot at a time—where code meets mechanics, and innovation drives possibility."
    },
    "Christopher": {
      "name": "Christopher Homan",
      "position": "Principal Investigator",
      "bio": "As the Head of Robotics at the nilab, I lead the charge in advancing our robotics projects, blending technical expertise with a visionary approach. My role involves guiding a talented team in the design, development, and implementation of cutting-edge robotic systems that push the boundaries of automation and AI integration. Passionate about exploring new technologies, I work to ensure that each project not only meets rigorous technical standards but also delivers real-world impact. I am committed to fostering an environment of innovation, continuous learning, and collaboration, making the nilab a hub for groundbreaking robotics research and application.",
      "story": "After studying business...",
      "quote": "Building the future, one robot at a time—where code meets mechanics, and innovation drives possibility."
    }
  },
  "ongoinProject": {
    "GEC_ZARMA_100": {
      "title": "GEC ZARMA",
      "date": "Octobre, 2024",
      "description": "Grammatical error correction (GEC) is important for improving written materials but remains challenging for low-resource languages like Zarma—spoken by over 5 million people in West Africa. This study compares rule-based methods, machine translation (MT) models, and large language models (LLMs) for GEC in Zarma. We evaluate each approach’s effective ness on our built dataset of over 250,000 examples using synthetic and human-annotated data. Our experiments show that the MT-based approach using the M2M100 model outperforms others, achieving a detection rate of 95.82% and a suggestion accuracy of 78.90% in automatic evaluations, and scoring 3.0 out of 5.0 in logical/grammar error correction during manual evaluations by native speakers.The rule-based method achieved perfect detection (100%) and high suggestion accuracy (96.27%) for spelling corrections but struggled with context-level errors. LLMs like MT5 small showed moderate performance with a detection rate of 90.62% and a suggestion accuracy of 57.15%. Our work highlights the potential of MT models to enhance GEC in low-resource languages, paving the way for more inclusive NLP tools."
    },
    "Turing_101": {
      "title": "Evaluating Human and AI Detection of AI-Generated Poetry: A Turing-like Test",
      "date": "Octobre, 2024",
      "description": "As artificial intelligence (AI) models become increasingly proficient in generating human-like text, particularly in creative domains like poetry, concerns arise about distinguishing between human and machine-authored works. In this study, we conduct a Turing-like test to evaluate whether human evaluators can reliably differentiate between human-written and AI-generated poetry. Our findings reveal that human evaluators achieved high identification accuracy—over 95%—with strong confidence levels, effectively distinguishing AI-generated poetry even when advanced models like GPT-4 produced sophisticated completions. In contrast, AI detection tools such as GPTZero and GPTID demonstrated limited effectiveness, with identification accuracies below 60%. These results highlight the challenges faced by AI detection tools in creative contexts and highlight the importance of human judgment in poetry writing."
    },
    "ASR_102": {
      "title": "ASR dataset for Niger Languages",
      "date": "Octobre, 2024",
      "description": "We aim to develop an ASR dataset of up to 20 hours long for 5 Niger languages."
    }
  },
  "ongoingProjectFar": {
    "Feriji_1000": {
      "title": "Feriji: A French-Zarma Parallel Corpus, Glossary & Translator",
      "date": "August, 2024",
      "description": "Machine translation (MT) is a rapidly expanding field that has experienced significant advancements in recent years with the development of models capable of translating multiple languages with remarkable accuracy. However, the representation of African languages in this field still needs improvement due to linguistic complexities and limited resources. This applies to the Zarma language, a dialect of Songhay (of the Nilo-Saharan language family) spoken by over 5 million people across Niger and neighboring countries (Lewis et al., 2016). This paper introduces Feriji, the first robust French-Zarma parallel corpus and glossary designed for MT. The corpus, containing 61,085 sentences in Zarma and 42,789 in French, and a glossary of 4,062 words represents a significant step in addressing the need for more resources for Zarma. We fine-tune three large language models on our dataset, obtaining a BLEU score of 30.06 on the best-performing model. We further evaluate the models on human judgments of fluency, comprehension, and readability and the importance and impact of the corpus and models. Our contributions help to bridge a significant language gap and promote an essential and overlooked indigenous African language."
    }
  },
  "footer": {
    "slogan": "Innovating Locally, Empowering Globally",
    "contactLink": "Contact Us",
    "programLink": "Research",
    "currentProjectLink": "Current Project",
    "pastProjectLink": "Past Project",
    "blog": "Blog",
    "latestBlog": "Our Latest Blog Posts",
    "allBlog": "All of Our Blogs",
    "aboutUs": "About us",
    "btn": "Back to top",
    "policy": "All rights reserved."
  }
}